; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	image1 - mode
	spectrograph0 - mode
	GroundStation0 - direction
	Star1 - direction
	Star4 - direction
	Star3 - direction
	Star5 - direction
	Star6 - direction
	GroundStation2 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
	Planet13 - direction
	Star14 - direction
	Star15 - direction
	Star16 - direction
	Phenomenon17 - direction
	Star18 - direction
	Planet19 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 Star3)
	(supports instrument1 image1)
	(calibration_target instrument1 Star5)
	(calibration_target instrument1 Star6)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star18)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 GroundStation2)
	(calibration_target instrument2 Star6)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon17)
)
(:goal (and
	(pointing satellite0 Planet19)
	(pointing satellite1 Star14)
	(have_image Phenomenon7 spectrograph0)
	(have_image Planet8 image1)
	(have_image Planet9 spectrograph0)
	(have_image Phenomenon10 spectrograph0)
	(have_image Phenomenon11 spectrograph0)
	(have_image Phenomenon12 image1)
	(have_image Planet13 spectrograph0)
	(have_image Star14 image1)
	(have_image Star15 image1)
	(have_image Star16 spectrograph0)
	(have_image Phenomenon17 image1)
	(have_image Star18 spectrograph0)
	(have_image Planet19 image1)
))

)

; plan
1. (turn_to satellite1 groundstation2 phenomenon17)
   deleted: (pointing satellite1 phenomenon17)
   added: (pointing satellite1 groundstation2)
   goals met: 0 of 15
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 15
3. (calibrate satellite1 instrument2 groundstation2)
   added: (calibrated instrument2)
   goals met: 0 of 15
4. (turn_to satellite1 planet13 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 planet13)
   goals met: 0 of 15
5. (take_image satellite1 planet13 instrument2 spectrograph0)
   added: (have_image planet13 spectrograph0)
   goals met: 1 of 15
6. (turn_to satellite1 phenomenon7 planet13)
   deleted: (pointing satellite1 planet13)
   added: (pointing satellite1 phenomenon7)
   goals met: 1 of 15
7. (take_image satellite1 phenomenon7 instrument2 spectrograph0)
   added: (have_image phenomenon7 spectrograph0)
   goals met: 2 of 15
8. (turn_to satellite1 phenomenon11 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 phenomenon11)
   goals met: 2 of 15
9. (take_image satellite1 phenomenon11 instrument2 spectrograph0)
   added: (have_image phenomenon11 spectrograph0)
   goals met: 3 of 15
10. (turn_to satellite1 phenomenon10 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 phenomenon10)
   goals met: 3 of 15
11. (turn_to satellite0 star5 star18)
   deleted: (pointing satellite0 star18)
   added: (pointing satellite0 star5)
   goals met: 3 of 15
12. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 3 of 15
13. (calibrate satellite0 instrument1 star5)
   added: (calibrated instrument1)
   goals met: 3 of 15
14. (take_image satellite1 phenomenon10 instrument2 spectrograph0)
   added: (have_image phenomenon10 spectrograph0)
   goals met: 4 of 15
15. (turn_to satellite0 phenomenon12 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 phenomenon12)
   goals met: 4 of 15
16. (take_image satellite0 phenomenon12 instrument1 image1)
   added: (have_image phenomenon12 image1)
   goals met: 5 of 15
17. (turn_to satellite0 phenomenon17 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 phenomenon17)
   goals met: 5 of 15
18. (take_image satellite0 phenomenon17 instrument1 image1)
   added: (have_image phenomenon17 image1)
   goals met: 6 of 15
19. (turn_to satellite0 planet8 phenomenon17)
   deleted: (pointing satellite0 phenomenon17)
   added: (pointing satellite0 planet8)
   goals met: 6 of 15
20. (take_image satellite0 planet8 instrument1 image1)
   added: (have_image planet8 image1)
   goals met: 7 of 15
21. (turn_to satellite0 star14 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star14)
   goals met: 7 of 15
22. (take_image satellite0 star14 instrument1 image1)
   added: (have_image star14 image1)
   goals met: 8 of 15
23. (turn_to satellite0 star15 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 star15)
   goals met: 8 of 15
24. (take_image satellite0 star15 instrument1 image1)
   added: (have_image star15 image1)
   goals met: 9 of 15
25. (turn_to satellite0 planet19 star15)
   deleted: (pointing satellite0 star15)
   added: (pointing satellite0 planet19)
   goals met: 10 of 15
26. (take_image satellite0 planet19 instrument1 image1)
   added: (have_image planet19 image1)
   goals met: 11 of 15
27. (turn_to satellite1 planet9 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 planet9)
   goals met: 11 of 15
28. (take_image satellite1 planet9 instrument2 spectrograph0)
   added: (have_image planet9 spectrograph0)
   goals met: 12 of 15
29. (turn_to satellite1 star16 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 star16)
   goals met: 12 of 15
30. (take_image satellite1 star16 instrument2 spectrograph0)
   added: (have_image star16 spectrograph0)
   goals met: 13 of 15
31. (turn_to satellite1 star18 star16)
   deleted: (pointing satellite1 star16)
   added: (pointing satellite1 star18)
   goals met: 13 of 15
32. (take_image satellite1 star18 instrument2 spectrograph0)
   added: (have_image star18 spectrograph0)
   goals met: 14 of 15
33. (turn_to satellite1 star14 star18)
   deleted: (pointing satellite1 star18)
   added: (pointing satellite1 star14)
   goals met: 15 of 15
